brzk4/Modbus-slave-STM8s/Libraries/STM8_TouchSensing_Driver/inc/stm8_tsl_checkconfig.h
#if defined(STM8L10X)
#define MKEY_CH4_MASK \
  ( ((MCKEY1_A_CH == CH4)? MCKEY1_A:0)|((MCKEY1_B_CH == CH4)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH4)? MCKEY1_C:0)|((MCKEY1_D_CH == CH4)? MCKEY1_D:0)|\
    ((MCKEY1_E_CH == CH4)? MCKEY1_E:0)|((MCKEY1_F_CH == CH4)? MCKEY1_F:0)|\
    ((MCKEY1_G_CH == CH4)? MCKEY1_G:0)|((MCKEY1_H_CH == CH4)? MCKEY1_H:0)\
  )
#endif

#elif NUMBER_OF_MULTI_CHANNEL_KEYS == 2

#define MKEY_CH1_MASK \
  ( ((MCKEY1_A_CH == CH1)? MCKEY1_A:0)|((MCKEY1_B_CH == CH1)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH1)? MCKEY1_C:0)|((MCKEY1_D_CH == CH1)? MCKEY1_D:0)|\
    ((MCKEY1_E_CH == CH1)? MCKEY1_E:0)|((MCKEY1_F_CH == CH1)? MCKEY1_F:0)|\
    ((MCKEY1_G_CH == CH1)? MCKEY1_G:0)|((MCKEY1_H_CH == CH1)? MCKEY1_H:0)|\
    ((MCKEY2_A_CH == CH1)? MCKEY2_A:0)|((MCKEY2_B_CH == CH1)? MCKEY2_B:0)|\
    ((MCKEY2_C_CH == CH1)? MCKEY2_C:0)|((MCKEY2_D_CH == CH1)? MCKEY2_D:0)|\
    ((MCKEY2_E_CH == CH1)? MCKEY2_E:0)|((MCKEY2_F_CH == CH1)? MCKEY2_F:0)|\
    ((MCKEY2_G_CH == CH1)? MCKEY2_G:0)|((MCKEY2_H_CH == CH1)? MCKEY2_H:0)\
  )
#define MKEY_CH2_MASK \
  ( ((MCKEY1_A_CH == CH2)? MCKEY1_A:0)|((MCKEY1_B_CH == CH2)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH2)? MCKEY1_C:0)|((MCKEY1_D_CH == CH2)? MCKEY1_D:0)|\
    ((MCKEY1_E_CH == CH2)? MCKEY1_E:0)|((MCKEY1_F_CH == CH2)? MCKEY1_F:0)|\
    ((MCKEY1_G_CH == CH2)? MCKEY1_G:0)|((MCKEY1_H_CH == CH2)? MCKEY1_H:0)|\
    ((MCKEY2_A_CH == CH2)? MCKEY2_A:0)|((MCKEY2_B_CH == CH2)? MCKEY2_B:0)|\
    ((MCKEY2_C_CH == CH2)? MCKEY2_C:0)|((MCKEY2_D_CH == CH2)? MCKEY2_D:0)|\
    ((MCKEY2_E_CH == CH2)? MCKEY2_E:0)|((MCKEY2_F_CH == CH2)? MCKEY2_F:0)|\
    ((MCKEY2_G_CH == CH2)? MCKEY2_G:0)|((MCKEY2_H_CH == CH2)? MCKEY2_H:0)\
  )
#define MKEY_CH3_MASK \
  ( ((MCKEY1_A_CH == CH3)? MCKEY1_A:0)|((MCKEY1_B_CH == CH3)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH3)? MCKEY1_C:0)|((MCKEY1_D_CH == CH3)? MCKEY1_D:0)|\
    ((MCKEY1_E_CH == CH3)? MCKEY1_E:0)|((MCKEY1_F_CH == CH3)? MCKEY1_F:0)|\
    ((MCKEY1_G_CH == CH3)? MCKEY1_G:0)|((MCKEY1_H_CH == CH3)? MCKEY1_H:0)|\
    ((MCKEY2_A_CH == CH3)? MCKEY2_A:0)|((MCKEY2_B_CH == CH3)? MCKEY2_B:0)|\
    ((MCKEY2_C_CH == CH3)? MCKEY2_C:0)|((MCKEY2_D_CH == CH3)? MCKEY2_D:0)|\
    ((MCKEY2_E_CH == CH3)? MCKEY2_E:0)|((MCKEY2_F_CH == CH3)? MCKEY2_F:0)|\
    ((MCKEY2_G_CH == CH3)? MCKEY2_G:0)|((MCKEY2_H_CH == CH3)? MCKEY2_H:0)\
  )

#if defined(STM8L10X)
#define MKEY_CH4_MASK \
  ( ((MCKEY1_A_CH == CH4)? MCKEY1_A:0)|((MCKEY1_B_CH == CH4)? MCKEY1_B:0)|\
    ((MCKEY1_C_CH == CH4)? MCKEY1_C:0)|((MCKEY1_D_CH == CH4)? MCKEY1_D:0)|\
    ((MCKEY1_E_CH == CH4)? MCKEY1_E:0)|((MCKEY1_F_CH == CH4)? MCKEY1_F:0)|\
    ((MCKEY1_G_CH == CH4)? MCKEY1_G:0)|((MCKEY1_H_CH == CH4)? MCKEY1_H:0)|\
    ((MCKEY2_A_CH == CH4)? MCKEY2_A:0)|((MCKEY2_B_CH == CH4)? MCKEY2_B:0)|\
    ((MCKEY2_C_CH == CH4)? MCKEY2_C:0)|((MCKEY2_D_CH == CH4)? MCKEY2_D:0)|\
    ((MCKEY2_E_CH == CH4)? MCKEY2_E:0)|((MCKEY2_F_CH == CH4)? MCKEY2_F:0)|\
    ((MCKEY2_G_CH == CH4)? MCKEY2_G:0)|((MCKEY2_H_CH == CH4)? MCKEY2_H:0)\
  )
#endif

#endif

//------------------------------------------------------------------------------
// Multi channel keys check
//------------------------------------------------------------------------------

#if (NUMBER_OF_MULTI_CHANNEL_KEYS < 0) || (NUMBER_OF_MULTI_CHANNEL_KEYS > 2)
#error "Wrong number of multi channel keys. Must be in the [0..2] range."
#endif

#if (NUMBER_OF_MULTI_CHANNEL_KEYS > 0)

#if defined(CHARGE_TRANSFER)
#if (CHANNEL_PER_MCKEY != 3) && (CHANNEL_PER_MCKEY != 5) && (CHANNEL_PER_MCKEY != 8)
#error "Wrong number of channel for multi channel keys. Must be equal to 3, 5 or 8."
#endif
#else // RC technology
#if (CHANNEL_PER_MCKEY != 5) && (CHANNEL_PER_MCKEY != 8)
#error "Wrong number of channel for multi channel keys. Must be equal to 5 or 8."
#endif
#endif

#ifndef MCKEY1_TYPE
#error "MCKEY1_TYPE is not defined."
#endif

#if (MCKEY1_TYPE != 0) && (MCKEY1_TYPE != 1)
#error "Wrong MCKEY1 type. Must be equal to 0 (wheel) or 1 (slider)."
#endif

#ifndef MCKEY1_LAYOUT_TYPE
#error "MCKEY1_LAYOUT_TYPE is not defined."
#endif

#if (MCKEY1_LAYOUT_TYPE != 0) && (MCKEY1_LAYOUT_TYPE != 1)
#error "Wrong MCKEY1 layout type. Must be equal to 0 (Interlaced) or 1 (Normal)."
#endif

#endif

#if (NUMBER_OF_MULTI_CHANNEL_KEYS > 1)

#ifndef MCKEY2_TYPE
#error "MCKEY2_TYPE is not defined."
#endif

#if (MCKEY2_TYPE != 0) && (MCKEY2_TYPE != 1)
#error "Wrong MCKEY2 type. Must be equal to 0 (wheel) or 1 (slider)."
#endif

#ifndef MCKEY2_LAYOUT_TYPE
#error "MCKEY2_LAYOUT_TYPE is not defined."
#endif

#if (MCKEY2_LAYOUT_TYPE != 0) && (MCKEY2_LAYOUT_TYPE != 1)
#error "Wrong MCKEY2 layout type. Must be equal to 0 (Interlaced) or 1 (Normal)."
#endif

#endif


//------------------------------------------------------------------------------
// Assign Comparators (for CHARGE_TRANSFER and STM8L10X only)
//------------------------------------------------------------------------------

#if defined(CHARGE_TRANSFER) && defined(STM8L10X)

#ifdef COMP1
#undef COMP1
#endif

#ifdef COMP2
#undef COMP2
#endif

#if (SCKEY_P1_A == GROUP1) || (SCKEY_P1_B == GROUP1) ||\
    (SCKEY_P2_A == GROUP1) || (SCKEY_P2_B == GROUP1) ||\
    (SCKEY_P3_A == GROUP1) || (SCKEY_P3_B == GROUP1)
#define COMP1 (1)
#endif

#if (SCKEY_P1_A == GROUP2) || (SCKEY_P1_B == GROUP2) ||\
    (SCKEY_P2_A == GROUP2) || (SCKEY_P2_B == GROUP2) ||\
    (SCKEY_P3_A == GROUP2) || (SCKEY_P3_B == GROUP2)
#define COMP2 (1)
#endif

#endif


//------------------------------------------------------------------------------
// Check SCKEY_Px_y settings (for CHARGE_TRANSFER and STM8L10X only)
//------------------------------------------------------------------------------

#if defined(CHARGE_TRANSFER) && defined(STM8L10X)

#if (SCKEY_P1_A != GROUP1) && (SCKEY_P1_A != GROUP2) && (SCKEY_P1_A != 0)
#error "SCKEY_P1_A must be equal to 0 or GROUP1 or GROUP2 only"
#endif

#if (SCKEY_P1_B != GROUP1) && (SCKEY_P1_B != GROUP2) && (SCKEY_P1_B != 0)
#error "SCKEY_P1_B must be equal to 0 or GROUP1 or GROUP2 only"
#endif

#if (SCKEY_P2_A != GROUP1) && (SCKEY_P2_A != GROUP2) && (SCKEY_P2_A != 0)
#error "SCKEY_P2_A must be equal to 0 or GROUP1 or GROUP2 only"
#endif

