brzk4/Modbus-slave-STM8s/Libraries/STM8_TouchSensing_Driver/inc/stm8_tsl_checkconfig.h
#if (SCKEY_P2_B != GROUP1) && (SCKEY_P2_B != GROUP2) && (SCKEY_P2_B != 0)
#error "SCKEY_P2_B must be equal to 0 or GROUP1 or GROUP2 only"
#endif

#if (SCKEY_P3_A != GROUP1) && (SCKEY_P3_A != GROUP2) && (SCKEY_P3_A != 0)
#error "SCKEY_P3_A must be equal to 0 or GROUP1 or GROUP2 only"
#endif

#if (SCKEY_P3_B != GROUP1) && (SCKEY_P3_B != GROUP2) && (SCKEY_P3_B != 0)
#error "SCKEY_P3_B must be equal to 0 or GROUP1 or GROUP2 only"
#endif

#if (SCKEY_P1_C != 0) || (SCKEY_P1_D != 0) || (SCKEY_P1_E != 0) ||\
    (SCKEY_P1_F != 0) || (SCKEY_P1_G != 0) || (SCKEY_P1_H != 0)
#error "SCKEY_P1_C to SCKEY_P1_H must be equal to 0"
#endif

#if (SCKEY_P2_C != 0) || (SCKEY_P2_D != 0) || (SCKEY_P2_E != 0) ||\
    (SCKEY_P2_F != 0) || (SCKEY_P2_G != 0) || (SCKEY_P2_H != 0)
#error "SCKEY_P2_C to SCKEY_P2_H must be equal to 0"
#endif

#endif


//------------------------------------------------------------------------------
// Check channels settings (for CHARGE_TRANSFER only)
//------------------------------------------------------------------------------

#if defined(CHARGE_TRANSFER)

#if (SCKEY_P1_CH == SAMP_CAP_CH)
#error "Wrong channel assigment: SCKEY_P1_CH and SAMP_CAP_CH must be different"
#endif

#if (SCKEY_P2_CH == SAMP_CAP_CH)
#error "Wrong channel assigment: SCKEY_P2_CH and SAMP_CAP_CH must be different"
#endif

#if defined(STM8L10X)

#if (SCKEY_P3_CH == SAMP_CAP_CH)
#error "Wrong channel assigment: SCKEY_P3_CH and SAMP_CAP_CH must be different"
#endif

#if (SCKEY_P4_CH == SAMP_CAP_CH)
#error "Wrong channel assigment: SCKEY_P4_CH and SAMP_CAP_CH must be different"
#endif

#endif

#if ((MCKEY1_A_CH == SAMP_CAP_CH) || (MCKEY1_B_CH == SAMP_CAP_CH) || (MCKEY1_C_CH == SAMP_CAP_CH) || (MCKEY1_D_CH == SAMP_CAP_CH) ||\
     (MCKEY1_E_CH == SAMP_CAP_CH) || (MCKEY1_F_CH == SAMP_CAP_CH) || (MCKEY1_G_CH == SAMP_CAP_CH) || (MCKEY1_H_CH == SAMP_CAP_CH))
#error "Wrong channel assigment: MCKEY1_x_CH and SAMP_CAP_CH must be different"
#endif

#if ((MCKEY2_A_CH == SAMP_CAP_CH) || (MCKEY2_B_CH == SAMP_CAP_CH) || (MCKEY2_C_CH == SAMP_CAP_CH) || (MCKEY2_D_CH == SAMP_CAP_CH) ||\
     (MCKEY2_E_CH == SAMP_CAP_CH) || (MCKEY2_F_CH == SAMP_CAP_CH) || (MCKEY2_G_CH == SAMP_CAP_CH) || (MCKEY2_H_CH == SAMP_CAP_CH))
#error "Wrong channel assigment: MCKEY2_x_CH and SAMP_CAP_CH must be different"
#endif

#endif

//----------------------------------------------------------------------------
//                       Acquisition slot selection
//----------------------------------------------------------------------------

#if defined(CHARGE_TRANSFER)

#if (NUMBER_OF_MULTI_CHANNEL_KEYS > 0)

#if (CHANNEL_PER_MCKEY == 3)

#define MCKEY1_USE_P1 (MCKEY1_A_CH == SCKEY_P1_CH)||(MCKEY1_B_CH == SCKEY_P1_CH)||(MCKEY1_C_CH == SCKEY_P1_CH)
#define MCKEY1_USE_P2 (MCKEY1_A_CH == SCKEY_P2_CH)||(MCKEY1_B_CH == SCKEY_P2_CH)||(MCKEY1_C_CH == SCKEY_P2_CH)
#if defined(SCKEY_P3_KEY_COUNT)
#define MCKEY1_USE_P3 (MCKEY1_A_CH == SCKEY_P3_CH)||(MCKEY1_B_CH == SCKEY_P3_CH)||(MCKEY1_C_CH == SCKEY_P3_CH)
#endif

#endif  // (CHANNEL_PER_MCKEY == 3)
#if (CHANNEL_PER_MCKEY == 5)

#define MCKEY1_USE_P1 (MCKEY1_A_CH == SCKEY_P1_CH)||(MCKEY1_B_CH == SCKEY_P1_CH)||(MCKEY1_C_CH == SCKEY_P1_CH)||\
  (MCKEY1_D_CH == SCKEY_P1_CH)||(MCKEY1_E_CH == SCKEY_P1_CH)
#define MCKEY1_USE_P2 (MCKEY1_A_CH == SCKEY_P2_CH)||(MCKEY1_B_CH == SCKEY_P2_CH)||(MCKEY1_C_CH == SCKEY_P2_CH)||\
  (MCKEY1_D_CH == SCKEY_P2_CH)||(MCKEY1_E_CH == SCKEY_P2_CH)
#if defined(SCKEY_P3_KEY_COUNT)
#define MCKEY1_USE_P3 (MCKEY1_A_CH == SCKEY_P3_CH)||(MCKEY1_B_CH == SCKEY_P3_CH)||(MCKEY1_C_CH == SCKEY_P3_CH)||\
  (MCKEY1_D_CH == SCKEY_P3_CH)||(MCKEY1_E_CH == SCKEY_P3_CH)
#endif

#endif  // (CHANNEL_PER_MCKEY == 5)
#if (CHANNEL_PER_MCKEY == 8)

#define MCKEY1_USE_P1 (MCKEY1_A_CH == SCKEY_P1_CH)||(MCKEY1_B_CH == SCKEY_P1_CH)||(MCKEY1_B_CH == SCKEY_P1_CH)||\
  (MCKEY1_D_CH == SCKEY_P1_CH)||(MCKEY1_E_CH == SCKEY_P1_CH)||\
  (MCKEY1_F_CH == SCKEY_P1_CH)||(MCKEY1_G_CH == SCKEY_P1_CH)||(MCKEY1_H_CH == SCKEY_P1_CH)
#define MCKEY1_USE_P2 (MCKEY1_A_CH == SCKEY_P2_CH)||(MCKEY1_B_CH == SCKEY_P2_CH)||(MCKEY1_B_CH == SCKEY_P2_CH)||\
  (MCKEY1_D_CH == SCKEY_P2_CH)||(MCKEY1_E_CH == SCKEY_P2_CH)||\
  (MCKEY1_F_CH == SCKEY_P2_CH)||(MCKEY1_G_CH == SCKEY_P2_CH)||(MCKEY1_H_CH == SCKEY_P2_CH)
#if defined(SCKEY_P3_KEY_COUNT)
#define MCKEY1_USE_P3 (MCKEY1_A_CH == SCKEY_P3_CH)||(MCKEY1_B_CH == SCKEY_P3_CH)||(MCKEY1_B_CH == SCKEY_P3_CH)||\
  (MCKEY1_D_CH == SCKEY_P3_CH)||(MCKEY1_E_CH == SCKEY_P3_CH)||\
  (MCKEY1_F_CH == SCKEY_P3_CH)||(MCKEY1_G_CH == SCKEY_P3_CH)||(MCKEY1_H_CH == SCKEY_P3_CH)
#endif

#endif  // (CHANNEL_PER_MCKEY == 8)

#endif // (NUMBER_OF_MULTI_CHANNEL_KEYS > 0)

#if (NUMBER_OF_MULTI_CHANNEL_KEYS > 1)

#if (CHANNEL_PER_MCKEY == 3)

#define MCKEY2_USE_P1 (MCKEY2_A_CH == SCKEY_P1_CH)||(MCKEY2_B_CH == SCKEY_P1_CH)||(MCKEY2_C_CH == SCKEY_P1_CH)
#define MCKEY2_USE_P2 (MCKEY2_A_CH == SCKEY_P2_CH)||(MCKEY2_B_CH == SCKEY_P2_CH)||(MCKEY2_C_CH == SCKEY_P2_CH)
#if defined(SCKEY_P3_KEY_COUNT)
#define MCKEY2_USE_P3 (MCKEY2_A_CH == SCKEY_P3_CH)||(MCKEY2_B_CH == SCKEY_P3_CH)||(MCKEY2_C_CH == SCKEY_P3_CH)
#endif

#endif  // (CHANNEL_PER_MCKEY == 3)
#if (CHANNEL_PER_MCKEY == 5)

#define MCKEY2_USE_P1 (MCKEY2_A_CH == SCKEY_P1_CH)||(MCKEY2_B_CH == SCKEY_P1_CH)||(MCKEY2_C_CH == SCKEY_P1_CH)||\
  (MCKEY2_D_CH == SCKEY_P1_CH)||(MCKEY2_E_CH == SCKEY_P1_CH)
#define MCKEY2_USE_P2 (MCKEY2_A_CH == SCKEY_P2_CH)||(MCKEY2_B_CH == SCKEY_P2_CH)||(MCKEY2_C_CH == SCKEY_P2_CH)||\
  (MCKEY2_D_CH == SCKEY_P2_CH)||(MCKEY2_E_CH == SCKEY_P2_CH)
#if defined(SCKEY_P3_KEY_COUNT)
#define MCKEY2_USE_P3 (MCKEY2_A_CH == SCKEY_P3_CH)||(MCKEY2_B_CH == SCKEY_P3_CH)||(MCKEY2_C_CH == SCKEY_P3_CH)||\
  (MCKEY2_D_CH == SCKEY_P3_CH)||(MCKEY2_E_CH == SCKEY_P3_CH)
#endif

#endif  // (CHANNEL_PER_MCKEY == 5)
#if (CHANNEL_PER_MCKEY == 8)

#define MCKEY2_USE_P1 (MCKEY2_A_CH == SCKEY_P1_CH)||(MCKEY2_B_CH == SCKEY_P1_CH)||(MCKEY2_B_CH == SCKEY_P1_CH)||\
  (MCKEY2_D_CH == SCKEY_P1_CH)||(MCKEY2_E_CH == SCKEY_P1_CH)||\
  (MCKEY2_F_CH == SCKEY_P1_CH)||(MCKEY2_G_CH == SCKEY_P1_CH)||(MCKEY2_H_CH == SCKEY_P1_CH)
#define MCKEY2_USE_P2 (MCKEY2_A_CH == SCKEY_P2_CH)||(MCKEY2_B_CH == SCKEY_P2_CH)||(MCKEY2_B_CH == SCKEY_P2_CH)||\
  (MCKEY2_D_CH == SCKEY_P2_CH)||(MCKEY2_E_CH == SCKEY_P2_CH)||\
  (MCKEY2_F_CH == SCKEY_P2_CH)||(MCKEY2_G_CH == SCKEY_P2_CH)||(MCKEY2_H_CH == SCKEY_P2_CH)
#if defined(SCKEY_P3_KEY_COUNT)
#define MCKEY2_USE_P3 (MCKEY2_A_CH == SCKEY_P3_CH)||(MCKEY2_B_CH == SCKEY_P3_CH)||(MCKEY2_B_CH == SCKEY_P3_CH)||\
  (MCKEY2_D_CH == SCKEY_P3_CH)||(MCKEY2_E_CH == SCKEY_P3_CH)||\
  (MCKEY2_F_CH == SCKEY_P3_CH)||(MCKEY2_G_CH == SCKEY_P3_CH)||(MCKEY2_H_CH == SCKEY_P3_CH)
#endif

