brzk4/Modbus-slave-STM8s/Libraries/STM8_TouchSensing_Driver/inc/stm8_tsl_checkconfig.h
#endif  // (CHANNEL_PER_MCKEY == 8)
#else
#define MCKEY2_USE_P1 0
#define MCKEY2_USE_P2 0
#define MCKEY2_USE_P3 0

#endif // (NUMBER_OF_MULTI_CHANNEL_KEYS > 1)

#if (SCKEY_P2_KEY_COUNT > 0)||(MCKEY1_USE_P2)||(MCKEY2_USE_P2)
#if (SCKEY_P3_KEY_COUNT > 0)||(MCKEY1_USE_P3)||(MCKEY2_USE_P3)
#define NUMBER_OF_ACQUISITION_PORTS (3)
#else
#define NUMBER_OF_ACQUISITION_PORTS (2)
#endif
#else
#define NUMBER_OF_ACQUISITION_PORTS (1)  // always used
#endif

#else //RC
#define NUMBER_OF_ACQUISITION_PORTS  NUMBER_OF_SINGLE_CHANNEL_PORTS
#endif // CT or RC

#if (NUMBER_OF_SINGLE_CHANNEL_KEYS == 0) && (NUMBER_OF_MULTI_CHANNEL_KEYS == 0)
#error "At least one key must be defined !"
#endif


//============================================================================
// TSL PARAMETERS CONFIGURATION
//============================================================================

#if !defined(NEGDETECT_AUTOCAL)
#error "Please define NEGDETECT_AUTOCAL (with value at 0 or 1)"
#endif

#if !defined(SPREAD_SPECTRUM)
#error "Please define SPREAD_SPECTRUM (with value at 0 or 1)"
#endif

#ifdef SW_SPREAD_SPECTRUM
#if !SPREAD_SPECTRUM && SW_SPREAD_SPECTRUM
#error "SW_SPREAD_SPECTRUM can only be enabled if SPREAD_SPECTRUM is enabled !"
#endif
#endif

#if (SPREAD_SPECTRUM && defined(STM8L10X)) || (SW_SPREAD_SPECTRUM &&defined(STM8L15X))
#if !SPREAD_COUNTER_MIN
#error " The SPREAD_COUNTER_MIN value must not be null !"
#endif
#endif

#if SPREAD_SPECTRUM
#if (SPREAD_COUNTER_MAX > 255) || (SPREAD_COUNTER_MAX <= SPREAD_COUNTER_MIN)
#error " The SPREAD_COUNTER_MAX value must be a 8-bit value in the range of [2 - 255] !"
#endif
#endif

#if defined(CHARGE_TRANSFER)
#ifndef ACTIVE_SHIELD_GROUP
#error "The ACTIVE_SHIELD_GROUP must be defined (set it to 0 to disable the Active Shield feature)!"
#else //ACTIVE_SHIELD_GROUP is defined
#if ACTIVE_SHIELD_GROUP
#if defined(STM8L15X)
#if (ACTIVE_SHIELD_GROUP == GROUP1)
#if (SCKEY_P1_CH == CH1)
//PA6 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOA)
#define ACTIVE_SHIELD_P1_BIT (1<<6)
#elif SCKEY_P1_CH == CH2
//PA5 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOA)
#define ACTIVE_SHIELD_P1_BIT (1<<5)
#elif SCKEY_P1_CH == CH3
//PA4 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOA)
#define ACTIVE_SHIELD_P1_BIT (1<<4)
#endif
#if (SCKEY_P2_CH == CH1)
//PA6 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOA)
#define ACTIVE_SHIELD_P2_BIT (1<<6)
#elif SCKEY_P2_CH == CH2
//PA5 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOA)
#define ACTIVE_SHIELD_P2_BIT (1<<5)
#elif SCKEY_P2_CH == CH3
//PA4 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOA)
#define ACTIVE_SHIELD_P2_BIT (1<<4)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP2)
#if (SCKEY_P1_CH == CH1)
//PC7 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOC)
#define ACTIVE_SHIELD_P1_BIT (1<<7)
#elif SCKEY_P1_CH == CH2
//PC4 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOC)
#define ACTIVE_SHIELD_P1_BIT (1<<4)
#elif SCKEY_P1_CH == CH3
//PC3 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOC)
#define ACTIVE_SHIELD_P1_BIT (1<<3)
#endif
#if (SCKEY_P2_CH == CH1)
//PC7 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOC)
#define ACTIVE_SHIELD_P2_BIT (1<<7)
#elif SCKEY_P2_CH == CH2
//PC4 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOC)
#define ACTIVE_SHIELD_P2_BIT (1<<4)
#elif SCKEY_P2_CH == CH3
//PC3 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOC)
#define ACTIVE_SHIELD_P2_BIT (1<<3)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP3)
#if (SCKEY_P1_CH == CH1)
//PC2 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOC)
#define ACTIVE_SHIELD_P1_BIT (1<<2)
#elif SCKEY_P1_CH == CH2
//PD7 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOD)
#define ACTIVE_SHIELD_P1_BIT (1<<7)
#elif SCKEY_P1_CH == CH3
//PD6 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOD)
#define ACTIVE_SHIELD_P1_BIT (1<<6)
#endif
#if (SCKEY_P2_CH == CH1)
//PC2 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOC)
#define ACTIVE_SHIELD_P2_BIT (1<<2)
#elif SCKEY_P2_CH == CH2
//PD7 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOD)
#define ACTIVE_SHIELD_P2_BIT (1<<7)
#elif SCKEY_P2_CH == CH3
//PD6 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOD)
#define ACTIVE_SHIELD_P2_BIT (1<<6)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP4)
#if (SCKEY_P1_CH == CH1)
//PD5 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOD)
#define ACTIVE_SHIELD_P1_BIT (1<<5)
#elif SCKEY_P1_CH == CH2
//PD4 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOD)
#define ACTIVE_SHIELD_P1_BIT (1<<4)
#elif SCKEY_P1_CH == CH3
//PB7 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOB)
#define ACTIVE_SHIELD_P1_BIT (1<<7)
#endif
#if (SCKEY_P2_CH == CH1)
//PD5 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOD)
#define ACTIVE_SHIELD_P2_BIT (1<<5)
#elif SCKEY_P2_CH == CH2
//PD4 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOD)
#define ACTIVE_SHIELD_P2_BIT (1<<4)
#elif SCKEY_P2_CH == CH3
//PB7 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOB)
#define ACTIVE_SHIELD_P2_BIT (1<<7)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP5)
#if (SCKEY_P1_CH == CH1)
//PB6 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOB)
#define ACTIVE_SHIELD_P1_BIT (1<<6)
#elif SCKEY_P1_CH == CH2
//PB5 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOB)
#define ACTIVE_SHIELD_P1_BIT (1<<5)
#elif SCKEY_P1_CH == CH3
//PB4 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOB)
#define ACTIVE_SHIELD_P1_BIT (1<<4)
#endif
#if (SCKEY_P2_CH == CH1)
//PB6 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOB)
#define ACTIVE_SHIELD_P2_BIT (1<<6)
#elif SCKEY_P2_CH == CH2
//PB5 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOB)
#define ACTIVE_SHIELD_P2_BIT (1<<5)
#elif SCKEY_P2_CH == CH3
//PB4 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOB)
#define ACTIVE_SHIELD_P2_BIT (1<<4)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP6)
#if (SCKEY_P1_CH == CH1)
//PB3 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOB)
#define ACTIVE_SHIELD_P1_BIT (1<<3)
#elif SCKEY_P1_CH == CH2
//PB2 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOB)
#define ACTIVE_SHIELD_P1_BIT (1<<2)
#elif SCKEY_P1_CH == CH3
//PB1 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOB)
#define ACTIVE_SHIELD_P1_BIT (1<<1)
#endif
#if (SCKEY_P2_CH == CH1)
//PB3 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOB)
#define ACTIVE_SHIELD_P2_BIT (1<<3)
#elif SCKEY_P2_CH == CH2
//PB2 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOB)
#define ACTIVE_SHIELD_P2_BIT (1<<2)
#elif SCKEY_P2_CH == CH3
//PB1 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOB)
#define ACTIVE_SHIELD_P2_BIT (1<<1)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP7)
#if (SCKEY_P1_CH == CH1)
//PB0 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOB)
#define ACTIVE_SHIELD_P1_BIT (1<<0)
#elif SCKEY_P1_CH == CH2
//PD3 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOD)
#define ACTIVE_SHIELD_P1_BIT (1<<3)
#elif SCKEY_P1_CH == CH3
//PD2 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOD)
#define ACTIVE_SHIELD_P1_BIT (1<<2)
#endif
#if (SCKEY_P2_CH == CH1)
//PB0 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOB)
#define ACTIVE_SHIELD_P2_BIT (1<<0)
#elif SCKEY_P2_CH == CH2
//PD3 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOD)
#define ACTIVE_SHIELD_P2_BIT (1<<3)
#elif SCKEY_P2_CH == CH3
//PD2 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOD)
#define ACTIVE_SHIELD_P2_BIT (1<<2)
#endif
#elif (ACTIVE_SHIELD_GROUP == GROUP8)
#if (SCKEY_P1_CH == CH1)
//PD1 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOD)
#define ACTIVE_SHIELD_P1_BIT (1<<1)
#elif SCKEY_P1_CH == CH2
//PD0 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOD)
#define ACTIVE_SHIELD_P1_BIT (1<<0)
#elif SCKEY_P1_CH == CH3
//PE5 define as active shield for port1
#define ACTIVE_SHIELD_P1_PORT (GPIOE)
#define ACTIVE_SHIELD_P1_BIT (1<<5)
#endif
#if (SCKEY_P2_CH == CH1)
//PD1 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOD)
#define ACTIVE_SHIELD_P2_BIT (1<<1)
#elif SCKEY_P2_CH == CH2
//PD0 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOD)
#define ACTIVE_SHIELD_P2_BIT (1<<0)
#elif SCKEY_P2_CH == CH3
//PE5 define as active shield for port2
#define ACTIVE_SHIELD_P2_PORT (GPIOE)
#define ACTIVE_SHIELD_P2_BIT (1<<5)
#endif
#else
#error "ACTIVE_SHIELD_GROUP must be a GROUP number i.e. a 8-bit value with only one bit set !"
#endif // end of #if (ACTIVE.... != GROUPx)

#else // (STM8L10X)
#if (!(ACTIVE_SHIELD_GROUP == GROUP1) || (ACTIVE_SHIELD_GROUP == GROUP2) || (ACTIVE_SHIELD_GROUP == GROUP3))
#error " ACTIVE_SHIELD_GROUP must be a GROUP number i.e. GROUP1, GROUP2 or  GROUP3 for STM8L10X!"
#endif // end of #if (ACTIVE.... != GROUPx)

#endif //end of #ifdef (STM8L15X) #else
#if (ACTIVE_SHIELD_GROUP == SCKEY_P1_A) || (ACTIVE_SHIELD_GROUP == SCKEY_P2_A) || (ACTIVE_SHIELD_GROUP == SCKEY_P3_A) || \
    (ACTIVE_SHIELD_GROUP == SCKEY_P1_B) || (ACTIVE_SHIELD_GROUP == SCKEY_P2_B) || (ACTIVE_SHIELD_GROUP == SCKEY_P3_B) || \
    (ACTIVE_SHIELD_GROUP == SCKEY_P1_C) || (ACTIVE_SHIELD_GROUP == SCKEY_P2_C) || \
    (ACTIVE_SHIELD_GROUP == SCKEY_P1_D) || (ACTIVE_SHIELD_GROUP == SCKEY_P2_D) || \
    (ACTIVE_SHIELD_GROUP == SCKEY_P1_E) || (ACTIVE_SHIELD_GROUP == SCKEY_P2_E) || \
    (ACTIVE_SHIELD_GROUP == SCKEY_P1_F) || (ACTIVE_SHIELD_GROUP == SCKEY_P2_F) || \
    (ACTIVE_SHIELD_GROUP == SCKEY_P1_G) || (ACTIVE_SHIELD_GROUP == SCKEY_P2_G) || \
    (ACTIVE_SHIELD_GROUP == SCKEY_P1_H) || (ACTIVE_SHIELD_GROUP == SCKEY_P2_H) || \
 (ACTIVE_SHIELD_GROUP == MCKEY1_A)   || (ACTIVE_SHIELD_GROUP == MCKEY2_A)   || \
 (ACTIVE_SHIELD_GROUP == MCKEY1_B)   || (ACTIVE_SHIELD_GROUP == MCKEY2_B)   || \
 (ACTIVE_SHIELD_GROUP == MCKEY1_C)   || (ACTIVE_SHIELD_GROUP == MCKEY2_C)   || \
 (ACTIVE_SHIELD_GROUP == MCKEY1_D)   || (ACTIVE_SHIELD_GROUP == MCKEY2_D)   || \
 (ACTIVE_SHIELD_GROUP == MCKEY1_E)   || (ACTIVE_SHIELD_GROUP == MCKEY2_E)   || \
 (ACTIVE_SHIELD_GROUP == MCKEY1_F)   || (ACTIVE_SHIELD_GROUP == MCKEY2_F)   || \
 (ACTIVE_SHIELD_GROUP == MCKEY1_G)   || (ACTIVE_SHIELD_GROUP == MCKEY2_G)   || \
 (ACTIVE_SHIELD_GROUP == MCKEY1_H)   || (ACTIVE_SHIELD_GROUP == MCKEY2_H)
#error "ACTIVE_SHIELD_GROUP cannot be a group used for a key !"
#endif // end of #if (ACTIVE....== SCKEY_Pn_X)
#endif //end of #if ACTIVE_SHIELD_GROUP
#endif //end of #ifndef ACTIVE_SHIELD_GROUP #else
#endif //end of #if defined(STM8L10X) || defined(STM8L15X)

//------------------------------------------------------------------------------
// Define the INLINE macro
//------------------------------------------------------------------------------
#if USE_INLINED_FUNCTIONS
#if defined(_COSMIC_)
#define INLINE @inline
#elif defined(_RAISONANCE_) // || defined(_IAR_)
#define INLINE inline
#elif defined(_IAR_)
/*<< IAR doesn't managed the global variables in inlined functions, so inlining is not supported in this released for IAR */
#define INLINE
#else
#error "Compiler not Supported"
#endif
#else
#define INLINE
#endif

#endif /* __TSL_CHECKCONFIG_H */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
